In [60]:
import pandas as pd 
import numpy as np

In [61]:
#1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [62]:
df=pd.DataFrame(np.random.randint(1,100, size=(6,4)),columns=['A','B','C','D'])
print(df)

    A   B   C   D
0  80  19  21  36
1  44  21  52  66
2  85  80  72  57
3  64  35  10  90
4  52  34  61  52
5   8  60  63   3

In [63]:
df.set_index('A',inplace=True)
print(df)

     B   C   D
A
80  19  21  36
44  21  52  66
85  80  72  57
64  35  10  90
52  34  61  52
8   60  63   3

In [64]:
#2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. 
#Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [65]:
df = pd.DataFrame(np.random.randint(1,50,size=(3,3)),columns=['A', 'B', 'C'], index=['X', 'Y', 'Z'])
df

    A   B   C
X  24  19  14
Y  44  10  36
Z  31   6   8

In [66]:
element = df.at['Y','B']
print(element)

10

In [67]:
#Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. 
#Add a new column that is the product of the first two columns.

In [68]:
df = pd.DataFrame(np.random.randint(1,50,size=(5,3)), columns=['A','B','C'])
df

    A   B   C
0  24  29  36
1   7  48  35
2   6  19  32
3  44  44  20
4  28  10  17

In [69]:
df['D'] = df['A'] * df['B']
df

    A   B   C     D
0  24  29  36   696
1   7  48  35   336
2   6  19  32   114
3  44  44  20  1936
4  28  10  17   280

In [70]:
#2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [71]:
df = pd.DataFrame(np.random.randint(1,50,size=(4,3)), columns=['A','B','C'])
df

    A   B   C
0  26  19  38
1  45  42  17
2  44  47  10
3  37   4  10

In [72]:
row_sum = df.sum(axis=1)
column_sum = df.sum(axis=0)

print("Row-wise sum:")
print(row_sum)
print("Column-wise sum:")
print(column_sum)

Row-wise sum:
0     83
1    104
2    101
3     51
dtype: int64
Column-wise sum:
A    152
B    112
C     75
dtype: int64

In [73]:
### Assignment 3: Data Cleaning

#1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. 
#Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [74]:
df = pd.DataFrame(np.random.randint(1, 100, size=(5, 3)), columns=['A', 'B', 'C'])
print("Original DataFrame:")
print(df)

Original DataFrame:
    A   B   C
0  50  75  86
1  64  70  67
2  98  88  52
3  67  44  18
4  52  13  80

In [75]:
# Introduce some NaN values
df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
print("DataFrame with NaN values:")
print(df)

DataFrame with NaN values:
      A     B     C
0  50.0   NaN  86.0
1  64.0  70.0  67.0
2  98.0  88.0   NaN
3  67.0  44.0  18.0
4   NaN  13.0  80.0

In [76]:
df.fillna(df.mean(),inplace=True)
print("DataFrame with NaN values filled:")
print(df)

DataFrame with NaN values filled:
       A      B      C
0  50.00  53.75  86.00
1  64.00  70.00  67.00
2  98.00  88.00  62.75
3  67.00  44.00  18.00
4  69.75  13.00  80.00

In [77]:
#2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. 
#Introduce some NaN values. Drop the rows with any NaN values.

In [78]:
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 4)), columns=['A', 'B', 'C','D'])
print("Original DataFrame:")
print(df)

Original DataFrame:
    A   B   C   D
0  69  20  26  72
1  71  85  17  53
2  70  72  99  38
3  57  75  12  88
4  87   6  95  92
5  12  66  18   5

In [79]:
# Introduce some NaN values
df.iloc[0, 1] = np.nan
df.iloc[2, 2] = np.nan
df.iloc[4, 0] = np.nan
df.iloc[5, 3] = np.nan
print("DataFrame with NaN values:")
print(df)

DataFrame with NaN values:
      A     B     C     D
0  69.0   NaN  26.0  72.0
1  71.0  85.0  17.0  53.0
2  70.0  72.0   NaN  38.0
3  57.0  75.0  12.0  88.0
4   NaN   6.0  95.0  92.0
5  12.0  66.0  18.0   NaN

In [80]:
df.dropna(inplace=True)
print("DataFrame with NaN values filled:")
print(df)

DataFrame with NaN values filled:
      A     B     C     D
1  71.0  85.0  17.0  53.0
3  57.0  75.0  12.0  88.0

In [81]:
#1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with 
#random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame 
#by 'Category' and compute the sum and mean of 'Value' for each category.

In [82]:
df = pd.DataFrame({'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Value':np.random.randint(1,100, size=10)})
print("Original DataFrame:")
print(df)

Original DataFrame:
  Category  Value
0        A     48
1        B     89
2        A     23
3        B     17
4        B      2
5        B     34
6        C     84
7        A     92
8        A     44
9        B     75

In [83]:
mean = df.groupby('Category')['Value'].agg(['sum','mean'])
mean

          sum   mean
Category
A         207  51.75
B         217  43.40
C          84  84.00

In [84]:
#2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. 
#Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [85]:
df = pd.DataFrame({'Product': np.random.choice(['Prod1', 'Prod2', 'Prod3'], size=10), 'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Sales': np.random.randint(1, 100, size=10)})
print("Original DataFrame:")
print(df)

Original DataFrame:
  Product Category  Sales
0   Prod3        A     76
1   Prod3        A      7
2   Prod3        C     72
3   Prod2        C     30
4   Prod1        C     89
5   Prod1        A     19
6   Prod2        C     54
7   Prod3        B     53
8   Prod2        A     10
9   Prod2        A     21